Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: This call to the insert(_:at:) method inserts a new item with a value of "Maple Syrup" at the very beginning of the shopping list, indicated by an index of 0.
ja: insert(_:at:)メソッドへのこの呼び出しは、"Maple Syrup"の値をもつ新しい項目を、0のインデックスによって指し示される、買い物リストのまさしくその開始位置で差し入れます。

source: This can be read as:
ja: これは、次のように解釈されることができます：

source: This can happen if two class instances hold a strong reference to each other, such that each instance keeps the other alive.
ja: ２つのクラスインスタンスが強い参照にお互いを守らせるならば、これは起こることができます、各インスタンスが他を生かしておくようなものです。

source: This capture might occur because the closure’s body accesses a property of the instance, such as self.someProperty, or because the closure calls a method on the instance, such as self.someMethod().
ja: この捕獲は、例えばself.somePropertyのようにクロージャの本文がインスタンスのプロパティにアクセスするために、または例えばself.someMethod()のようにクロージャがインスタンスのメソッドを呼ぶために起こるかもしれません。

source: This chapter describes parameters and arguments for generic types, functions, and initializers.
ja: この章は、総称体の型、関数、そしてイニシャライザに対するパラメータと引数を記載します。

source: This chapter describes the common operators in Swift.
ja: この章は、スウィフトの通常の演算子を記載します。

source: This chapter describes those situations and shows how you enable ARC to manage all of your app’s memory.
ja: この章は、それらの状況を記載して、あなたがどのようにARCにあなたのアプリのメモリの全てを管理させるかについて示します。

source: This chapter discusses the types defined in the Swift language itself and describes the type inference behavior of Swift.
ja: この章は、スウィフト言語それ自身によって定義される型を議論して、スウィフトの型推論挙動を記載します。

source: This chapter now focuses more on the addition of new functionality in a subclass, and the modification of existing functionality with overrides.
ja: この章は、今やサブクラスにおける追加された新しい機能性、そしてオーバーライドを使った既存の機能性の変更にもっと焦点を当てられます。

source: This character can be represented as a single code unit in UTF-16.
ja: この文字は、UTF-16において単一の符号単位で表わされることが出来ます。

source: This check ensures that your overriding definition is correct.
ja: この調査は、あなたのオーバーライドの定義が正しいことを確実にします。

source: This class has four variable stored properties.
ja: このクラスは、４つの変数の格納プロパティを持ちます。

source: This class has three optional properties of type String?.
ja: このクラスは、型String?の３つのオプショナルのプロパティを持ちます。

source: This class implements a pseudorandom number generator algorithm known as a linear congruential generator:
ja: このクラスは、線形合同法生成器として知られている擬似乱数生成器アルゴリズムを実装します：

source: This class implements the fullName property requirement as a computed read-only property for a starship.
ja: このクラスは、fullNameプロパティ要件をある宇宙船のための読み出し専用の計算プロパティとして実装します。

source: This class might be used with input data from a pedometer or other step counter to keep track of a person’s exercise during their daily routine.
ja: このクラスは、万歩計または他の歩数計からの入力データとともに、ある個人の日課の運動の経過を追うために使われるかもしれません。

source: This class models a document that can be initialized with a name property that is either a nonempty string value or nil, but cannot be an empty string:
ja: このクラスはある書類をモデル化します、それは空でない文字列かnilのどちらかであるnameプロパティで初期化されることができます、しかし空の文字列であることはできません：

source: This class provides basic functionality for any kind of item that appears in a digital media library.
ja: このクラスは、基本の機能性をデジタル・メディア図書館に現れるあらゆる種類の項目のために用意します。

source: This code can be read as:
ja: このコードは、次のように解釈されることができます：

source: This code uses optional chaining in a key path to access a property of an optional string:
ja: このコードは、オプショナル連鎖をキーパスの中で使うことで、あるオプショナル文字列に属するプロパティにアクセスします：

source: This code uses the key path expression \OuterStructure.outer.someValue to access the someValue property of the OuterStructure type’s outer property:
ja: このコードは、キーパス式\OuterStructure.outer.someValueを使って、someValueプロパティにアクセスします、そのプロパティはOuterStructure型の持つouterプロパティに属しています：

source: This color is then decomposed into its red (CC), green (66), and blue (99) components by the bitwise AND operator (&) and the bitwise right shift operator (>>).
ja: この色はそれから、ビット単位の論理積演算子（&）とビット単位の右シフト演算子（>>）によって、それの赤（CC）、緑（66）、そして青（99）の構成要素に分解されます。

source: This combination results in a compile-time error that the declaration has been renamed.
ja: この連携は、宣言が改名されてしまっているというコンパイル時エラーという結果になります。

source: This computed property considers the rank of the card and initializes a new Values instance with appropriate values based on its rank.
ja: この計算プロパティは、カードの等級を考慮して、その等級に基づいた適切な値で新しいValuesインスタンスを初期化します。

source: This condition tests whether it’s possible to import the module, but doesn’t actually import it.
ja: この条件は、そのモジュールがインポート可能であるかどうかをテストします、しかし実際にそれをインポートはしません。

source: This confirms that initialization has taken place.
ja: これは、初期化が起こったことを確認します。

source: This constraint ensures that each element of the sequence is equatable.
ja: この制約はシーケンスの各要素が同等比較可能であることを保証します。

source: This constraint prevents a situation in which additional essential setup provided in a more complex initializer is accidentally circumvented by someone using one of the automatic initializers.
ja: この制約は、あるより複雑なイニシャライザにおいて提供される追加の重要な準備が、自動的なイニシャライザのうちの１つを使う何かによって図らずも回避される状況を防ぎます。

source: This continues up the class inheritance chain until the top of the chain is reached.
ja: これは、クラス継承連鎖を上って、その連鎖の最上部に着くまで続きます。

source: This convenience initializer assumes a quantity of 1 for any RecipeIngredient instance that is created without an explicit quantity.
ja: この便宜イニシャライザは、はっきりした量なしで作成されるあらゆるRecipeIngredientインスタンスに対して数量1を仮定します。

source: This convenience initializer cannot yet modify any properties.
ja: この便宜イニシャライザは、まだどのプロパティも修正することはできません。

source: This convenience initializer simply delegates across to the class’s designated initializer, passing in a quantity value of 1.
ja: この便宜イニシャライザはそのクラスの指定イニシャライザに、単純にquantityに値1を渡して横に委任します。

source: This creates a new instance of the class or structure, with any properties initialized to their default values.
ja: これは、クラスまたは構造体の新しいインスタンスをつくり、どんなプロパティでもそれらの省略時の値に初期化されます。

source: This data source is defined by the CounterDataSource protocol, which has two optional requirements:
ja: このデータ・ソースはCounterDataSourceプロトコルによって定義されます、それは、２つのオプショナルの要件を持ちます：

source: This default case is indicated by the default keyword, and must always appear last.
ja: defaultケース節は、キーワードdefaultによって示されて、常に最後に現れなければなりません。

source: This definition doesn’t provide any actual Int or String values—it just defines the type of associated values that Barcode constants and variables can store when they are equal to Barcode.upc or Barcode.qrCode.
ja: この定義は、何ら実際のIntまたはString値を提供しません ― それは、ただ単に関連値の型を定義します、それは、Barcode定数と変数がBarcode.upcもしくはBarcode.qrCodeに等しいときに格納できる型です。

source: This definition indicates that a getter-setter block can consist of a getter clause followed by an optional setter clause, enclosed in braces, or a setter clause followed by a getter clause, enclosed in braces.
ja: この定義は、１つのゲッターセッター・ブロックが、１つのゲッター節とそれに続く任意の１つのセッター節、それを波括弧でくくったもの、または、１つのゲッター節に１つのセッター節を続けて波括弧でくくったものから成ることができることを示します。

source: This definition of multiple subscripts is known as subscript overloading.
ja: この複数の添え字の定義は、添え字オーバーロードとして知られています。

source: This design pattern is implemented by defining a protocol that encapsulates the delegated responsibilities, such that a conforming type (known as a delegate) is guaranteed to provide the functionality that has been delegated.
ja: このデザイン・パターンは、委任された責務をカプセル化するプロトコルを定義することによって実装されます、例えば、委任プロトコルに拠準する型が（代表、委任先として知られるものが）その委任されている機能性を提供する責任を負わされるといったこと。

source: This designated initializer matches a designated initializer from the superclass of Bicycle, and so the Bicycle version of this initializer is marked with the override modifier.
ja: この指定イニシャライザはBicycleのスーパークラスでのある指定イニシャライザと一致します、なのでこのイニシャライザのBicycle改変板はoverride修飾子で印されます。

source: This dictionary literal contains two String: String pairs.
ja: この辞書リテラルは、String: Stringの組みを２つ含みます。

source: This distinction is not visible when the captured variable’s type has reference semantics.
ja: この相違は、キャプチャされた変数の型が参照意味論を持つ場合には見られません。

source: This does not, however, cause the observer to be called again.
ja: これは、しかし、このオブザーバーが再び呼び出されるようにしません。

source: This empty protocol indicates that a type can be used for error handling.
ja: この空のプロトコルは、ある型がエラー処理のために使われることができるのを示します。

source: This enables TrackedString to modify the numberOfEdits property internally, but to present the property as a read-only property when it’s used outside the structure’s definition.
ja: これがTrackedStringに可能にするのは、numberOfEditsプロパティを内部のように修正すること、しかしそのプロパティをそれが構造体の定義の外側で使われる時は読み出し専用プロパティとして提供することです。

source: This enables printMathResult(_:_:_:) to hand off some of its functionality to the caller of the function in a type-safe way.
ja: これは、printMathResult(_:_:_:)にその機能性の一部をその関数の呼び出し手に、ある型安全な方法で、手渡すことを可能にします。

source: This enables both properties to be accessed directly (without optional unwrapping) once initialization is complete, while still avoiding a reference cycle.
ja: これは、一旦初期化が終了しているならば、両方のプロパティが直接にアクセスされるのを（オプショナルをアンラップすることなく）可能にします、その一方で、依然として参照循環を避けます。

source: This enables structures and enumerations to adopt the protocol and satisfy that method requirement.
ja: これは、構造体と列挙に、そのプロトコルを採用してメソッド要件を満たすのを可能にします。

source: This enables you to be notified when the value of an inherited property changes, regardless of how that property was originally implemented.
ja: これはあなたに、そのプロパティが元々どのように実装されるかに関係なく、継承されたプロパティの値が変わるとき通知されることを可能にします。

source: This enables you to catch and fix errors as early as possible in the development process.
ja: これは、あなたに開発過程においてエラーをできるだけ早く捕えて修復するのを可能にします。

source: This enables you to check for a successful downcast.
ja: これは、あなたに成功したダウンキャストについて調べるのを可能にします。

source: This enables you to check for their existence within the closure’s body.
ja: これはあなたに、クロージャの本文内でそれらの存在について調べることを可能にします。

source: This enables you to check whether or not an update took place.
ja: これはあなたに、更新が起こったかどうか、確認することを可能にします。

source: This enables you to create protocols that can only be adopted within a certain access context.
ja: これは、あなたに特定のアクセス文脈内で採用されることだけができるプロトコルを作成するのを可能にします。

source: This enables you to define a subclass for which initialization cannot fail, even though initialization of the superclass is allowed to fail.
ja: これはあなたに、それに対しての初期化が失敗することが出来ないサブクラスを定義することを可能にします、たとえスーパークラスの初期化が失敗することが許されるとしてもです。

source: This enables you to drill down into subproperties within complex models of interrelated types, and to check whether it is possible to access properties, methods, and subscripts on those subproperties.
ja: これはあなたに、相互に関係づけられた型である複雑なモデルの内部の下位情報に掘り下げていくこと、そしてそれらの下位情報上でプロパティ、メソッド、そして添え字にアクセスすることが可能であるかどうか確認することを可能にします。

source: This enables you to extend other types to accept your own custom types as initializer parameters, or to provide additional initialization options that were not included as part of the type’s original implementation.
ja: これは、あなたに別の型を拡張してあなた独自のあつらえの型をイニシャライザパラメータとして受け入れるようにすること、またはその型の最初の実装の一部として含まれなかった追加の初期化選択肢を提供することを可能にします。

source: This enables you to leave some aspects of a function’s implementation for the function’s caller to provide when the function is called.
ja: これはあなたに、ある関数の実装のいくつかの側面をその関数の呼び出し側のために、その関数が呼ばれるとき提供する目的で、取っておくことを可能にします。

source: This enables you to see whether instances of Person and Apartment are being deallocated as expected.
ja: これは、あなたに期待されるようにPersonとApartmentのインスタンスが割り当て解除されているかどうか知ることを可能にします。

source: This enables you to use an if statement to check whether it was possible to call the printNumberOfRooms() method, even though the method does not itself define a return value.
ja: これはあなたにif文をprintNumberOfRooms()メソッドを呼び出すことが可能か調べるために使うことを可能にします、たとえそのメソッドがそれ自身では戻り値を定義しないとしてもです。

source: This encoding for negative numbers is known as a two’s complement representation.
ja: この負数のための符号化は、２の補数表現として知られています。

source: This ensures that a CreditCard instance always has a customer instance associated with it when the CreditCard instance is created.
ja: これは、CreditCardインスタンスがつくられるとき、CreditCardインスタンスが常にそれと結びつけられるCustomerインスタンスを持つことを確実にします。

source: This ensures that all of the protocol’s requirements will be visible on any type that adopts the protocol.
ja: これは、プロトコルを採用するあらゆる型上で、プロトコルのもつ要件の全てが見えることを確実にします。

source: This ensures that class instances do not take up space in memory when they are no longer needed.
ja: これは、クラスインスタンスが、それらがもはや必要でない時に、メモリ上で場所を取らないことを確実にします。

source: This ensures that the numberOfWheels inherited property is initialized by Vehicle before Bicycle has the opportunity to modify the property.
ja: これは継承されたプロパティnumberOfWheelsが、Bicycleがそのプロパティを変更する機会を得る前に、Vehicleによってイニシャライズされることを確実にします。

source: This ensures that the indices in the sequence are the same type as the indices used for a container.
ja: これは、このシーケンスのインデックスがコンテナに対して使われるインデックスと同じ型であるのを保証することになります。

source: This ensures that, no matter which part of the compound case matched, the code in the body of the case can always access a value for the bindings and that the value always has the same type.
ja: これは、たとえ複合ケース節のどの部分がマッチしたとしても、ケース節の本文のコードが常に束縛のための値にアクセスできること、そしてその値が常に同じ型を持つことを確実にします。

source: This enumeration can store three kinds of arithmetic expressions: a plain number, the addition of two expressions, and the multiplication of two expressions.
ja: この列挙は、３種類の算術式：普通の数字、２つの式の加算、そして２つの式の乗算を格納することができます。

source: This enumeration toggles between two states, indicated by the enumeration cases on and off.
ja: この列挙は、列挙のケース節onとoffで示される、２つの状態の間で切替えをします。

source: This enumeration, called Kind, expresses the kind of number that a particular integer represents.
ja: この列挙は、Kindと呼ばれ、特定の整数を表わす数の種類を表わします。

source: This exactly matches the method type needed by the sorted(by:) method.
ja: これは、sorted(by:)メソッドによって必要とされるメソッド型に正確に適合します。

source: This example adds a new nested enumeration to Int.
ja: この例は、新しい入れ子にされた列挙をIntに加えます。

source: This example adds an average() method to containers whose Item type is Double.
ja: この例は、average()メソッドを、Item型がDoubleであるコンテナに追加します。

source: This example adds an integer subscript to Swift’s built-in Int type.
ja: この例は、整数添え字をスウィフトの組み込みのInt型に加えます。

source: This example adds five computed instance properties to Swift’s built-in Double type, to provide basic support for working with distance units:
ja: この例は、５つの計算インスタンスプロパティをスウィフトの組み込みのDouble型に加えて、距離単位を扱うための基本的な支持を提供します：

source: This example adds together the vectors (3.0, 1.0) and (2.0, 4.0) to make the vector (5.0, 5.0), as illustrated below.
ja: この例は、下で図示されるように、ベクトル(3.0, 1.0)と(2.0, 4.0)を加えて一緒にして、ベクトル(5.0, 5.0)を作ります。

source: This example also adds a new computed instance property to Int, called kind, which returns the appropriate Kind enumeration case for that integer.
ja: この例はまた、新しい計算インスタンスプロパティをIntに加えます、それは、kindと呼ばれ、その整数に対する適切なKind列挙ケース節を返します。

source: This example also demonstrates a challenge you may encounter when fixing conflicting access to memory: There are sometimes multiple ways to fix the conflict that produce different answers, and it’s not always obvious which answer is correct.
ja: この例はまた、メモリアクセスの衝突を直す場合にあなたが直面するある困難を実演します；時として複数の方法が衝突を修正するために存在してそれらは異なる答えを生み出します、そしてどの答えが正しいか必ずしも明確ではありません。

source: This example also shows how reference types can be harder to reason about.
ja: この例はまた、どれくらい参照型について思考するのが困難になりうるかを示します。

source: This example checks numberSymbol to determine whether it is a Latin, Arabic, Chinese, or Thai symbol for the numbers 1 to 4.
ja: この例は、numberSymbolを、それが1から4のラテン、アラビア語、中国語、またはタイ語であるかどうか明らかにするために調べます。

source: This example considers two Bool values and only allows access if both values are true:
ja: この例は、２つのBool値を考慮して、両方の値がtrueの場合にのみアクセスを許します：

source: This example creates a new variable called productBarcode and assigns it a value of Barcode.upc with an associated tuple value of (8, 85909, 51226, 3).
ja: この例は、productBarcodeと呼ばれる新しい変数をつくって、それにあるひとつのBarcode.upcの値を関連したタプル値(8, 85909, 51226, 3)とともに代入します。

source: This example creates an array of TextRepresentable things:
ja: この例は、TextRepresentableなものの配列をつくります：

source: This example creates an empty dictionary of type [Int: String] to store human-readable names of integer values.
ja: この例は、型[Int: String]の空の辞書を、整数値の人間の読み込み可能な名前を格納するために作成します。

source: This example declares a constant called hd and sets it to a Resolution instance initialized with the width and height of full HD video (1920 pixels wide by 1080 pixels high).
ja: この例は、hdと呼ばれる定数を宣言して、それをフルHDビデオの幅と高さ（1920ピクセル幅の広さで1080ピクセルの高さ）で初期化されるResolutionインスタンスに対して設定します。

source: This example declares a new String variable called description and assigns it an initial value.
ja: この例は、descriptionと呼ばれる新しいString変数を宣言して、それに最初の値を代入します。

source: This example declares a new constant called tenEighty and sets it to refer to a new instance of the VideoMode class.
ja: この例は、tenEightyと呼ばれる新しい定数を宣言して、それをVideoModeクラスの新しいインスタンスに言及するように設定します。

source: This example defines a class called ShoppingListItem, which encapsulates the name, quantity, and purchase state of an item in a shopping list:
ja: この例はShoppingListItemと呼ばれるクラスを定義します、それは、ある購入品目リストにおける名前、量、そしてある項目の購入状態といったものをカプセル化します：

source: This example defines a class called HTMLElement, which provides a simple model for an individual element within an HTML document:
ja: この例はHTMLElementと呼ばれるクラスを定義します、それは、HTML文書内個々の要素に対する単純なモデルを用意します：

source: This example defines a function called printMathResult(_:_:_:), which has three parameters.
ja: この例はprintMathResult(_:_:_:)と呼ばれる関数を定義します、それは３つのパラメータを持ちます。

source: This example defines a hierarchy of three classes called Food, RecipeIngredient, and ShoppingListItem, and demonstrates how their initializers interact.
ja: この例は、Food、RecipeIngredient、そしてShoppingListItemと呼ばれる３つのクラスの階層を定義して、それらのイニシャライザが相互に作用する方法を示します。

source: This example defines a new class called Dice, which represents an n-sided dice for use in a board game.
ja: この例はDiceと呼ばれる新しいクラスを定義します、それは、ボードゲームで使うのためにn面のさいころを表します。

source: This example defines a new protocol, PrettyTextRepresentable, which inherits from TextRepresentable.
ja: この例は、ある新しいプロトコル、PrettyTextRepresentableを定義します、それは、TextRepresentableから継承を受けます。

source: This example defines a new structure called Cuboid, which represents a 3D rectangular box with width, height, and depth properties.
ja: この例はCuboidと呼ばれる新しい構造体を定義します、それは、width、height、そしてdepthプロパティで3D矩形の箱を表します。

source: This example defines a protocol called HasArea, with a single property requirement of a gettable Double property called area:
ja: この例は、areaと呼ばれる取得可能なDoubleプロパティである１つだけのプロパティ要件をもつ、HasAreaと呼ばれるプロトコルを定義します：

source: This example defines a structure called Person, which represents a specific named person.
ja: この例は、Personと呼ばれる構造体を定義します、それは、特定の名前の人物を表します。

source: This example defines an enumeration for a three-state switch.
ja: この例は、３つの状態を切り替えるために、ある列挙を定義します。

source: This example defines another subclass of Vehicle, called Hoverboard.
ja: この例は、もう１つVehicleのサブクラスを定義します、それはHoverboardと呼ばれます。

source: This example defines three structures for working with geometric shapes:
ja: この例は、幾何学形を扱うために３つの構造体を定義します：

source: This example defines two classes called DataImporter and DataManager, neither of which is shown in full:
ja: この例は、DataImporterとDataManagerと呼ばれる２つのクラスを定義します、そのどちらも全部は示されません：

source: This example defines two classes called Person and Apartment, which model a block of apartments and its residents:
ja: この例はPersonとApartmentと呼ばれる２つのクラスを定義します、それは、アパートの１区画とその居住者をモデル化します：

source: This example defines two new types, Bank and Player, for a simple game.
ja: この例は、２つの新しい型BankとPlayerを、単純なゲームのために定義します。

source: This example defines two simple mathematical functions called addTwoInts and multiplyTwoInts.
ja: この例は、addTwoIntsとmultiplyTwoIntsと呼ばれる２つの単純な数学的な関数を定義します。

source: This example highlights the way that an opaque return type is like the reverse of a generic type.
ja: この例は、不透明型が総称体型のまるで逆であるやり方に光を当てます。

source: This example identifies Uranus from its raw value of 7:
ja: この例は、その生の値の7からUranus（天王星）を特定します：

source: This example initializes a UInt8 integer with the binary value 00001111, which has its first four bits set to 0, and its second four bits set to 1.
ja: この例は、UInt8整数を２進数の値00001111で初期化します、それは、その最初の４つのビットを0に設定して、次の４つのビットを1に設定します。

source: This example is sorting an array of String values, and so the sorting closure needs to be a function of type (String, String) -> Bool.
ja: この例はString値の配列を分類しています、なのでソート・クロージャは型(String, String) -> Boolの関数である必要があります。

source: This example iterates through all items in the library array.
ja: この例は、library配列の中の全ての項目の端が端まで繰り返します。

source: This example plays a simple game of Snakes and Ladders (also known as Chutes and Ladders):
ja: この例は、単純なゲームの「ヘビとはしご」（また、「荷すべらしとはしご」として知られます）で遊びます：

source: This example prints the first few entries in a five-times table:
ja: この例は、九九の５の段の表の最初のいくつかの項を出力します：

source: This example provides a type annotation for a variable called welcomeMessage, to indicate that the variable can store String values:
ja: この例は、welcomeMessageと呼ばれる変数に対して、その変数はString値を格納できることを示すために型注釈を提供します：

source: This example sets a constant called incrementByTen to refer to an incrementer function that adds 10 to its runningTotal variable each time it is called.
ja: この例は、incrementByTenと呼ばれる定数を、それが呼ばれるたびに10をそのrunningTotal変数に加えるあるインクリメンタ関数に言及するように設定します。

source: This example starts with a simple class called Person, which defines a stored constant property called name:
ja: この例は、Personと呼ばれる単純なクラスから始めます、それは、nameと呼ばれる格納定数プロパティを定義します：

source: This example uses a UInt32 constant called pink to store a Cascading Style Sheets color value for the color pink.
ja: この例は、ピンク色のカスケーディング・スタイル・シートの色値を保存するために、pinkと呼ばれるUInt32定数を使います。

source: This example uses a for-in loop to iterate over the items in an array:
ja: この例は、for-inループを使って、ある配列の中の項目すべてにわたって繰り返していきます：

source: This example uses a switch statement to consider a single lowercase character called someCharacter:
ja: この例はswitch文を１つの小文字の文字、someCharacterと呼ばれるものについて考察するために使います：

source: This example uses a subscript in a key path to access the second element of an array:
ja: この例は、キーパス式において添え字を使って、配列の２番目の要素にアクセスします。

source: This example uses multiple && and || operators to create a longer compound expression.
ja: この例は、より長く複雑な式をつくるために複数の&&と||演算子を使用します。

source: This example uses number intervals to provide a natural-language count for numbers of any size:
ja: この例は、自然言語の数え方をどんな大きさの数にも用意するために、数の区間を使います：

source: This example uses optional binding to try to access a planet with a raw value of 11.
ja: この例は、11の生の値で惑星にアクセスすることを試みるためにオプショナル束縛を使います。

source: This example’s willSet observer uses a custom parameter name of newTotalSteps for the upcoming new value.
ja: この例のwillSetオブザーバーは、来るべき新しい値のためにあつらえのパラメータ名newTotalStepsを使用します。

source: This exception ensures that an older compiler doesn’t attempt to parse syntax introduced in a newer version of Swift.
ja: この例外は、古いコンパイラがより新しいバージョンのスウィフトで導入される構文の解析を試みないことを確実にします。

source: This expression calculates the value of Double(multiplier) * 2.5 and inserts the result (7.5) into the string.
ja: この式は、Double(multiplier) * 2.5の値を計算して、結果（7.5）を文字列に差し込みます。

source: This extension adopts the new protocol in exactly the same way as if Dice had provided it in its original implementation.
ja: この拡張は、まるでDiceがその最初の実装においてそれを提供したかのように、正確に同じふうに新しいプロトコルを採用します。

source: This extension states that it adopts the PrettyTextRepresentable protocol and provides an implementation of the prettyTextualDescription property for the SnakesAndLadders type.
ja: この拡張が述べるのは、それがPrettyTextRepresentableプロトコルを採用してprettyTextualDescriptionプロパティの実装をSnakesAndLadders型に提供することです。

source: This extension to the Container protocol adds a subscript that takes a sequence of indices and returns an array containing the items at each given index.
ja: このContainerプロトコルに対する拡張は、ある添え字を追加します、それはインデックスのシーケンスをとって、与えられたインデックスそれぞれでの項目を含んでいる配列を返します。

source: This failure might be triggered by invalid initialization parameter values, the absence of a required external resource, or some other condition that prevents initialization from succeeding.
ja: この失敗は、無効な初期化パラメータ、必須の外部リソースの欠如、または初期化がうまくいくのを妨げる何か他の状況によって引き起こされるかもしれません。
